import pytest
from curses_modul import test_modul

courses = [
    "Python-разработчик с нуля",
    "Java-разработчик с нуля",
    "Fullstack-разработчик на Python",
    "Frontend-разработчик с нуля"
]

mentors = [
    ["Евгений Шмаргунов", "Олег Булыгин", "Дмитрий Демидов", "Кирилл Табельский", 
     "Александр Ульянцев", "Александр Бардин", "Александр Иванов", "Антон Солонилин", 
     "Максим Филипенко", "Елена Никитина", "Азамат Искаков", "Роман Гордиенко"],
    ["Филипп Воронов", "Анна Юшина", "Иван Бочаров", "Анатолий Корсаков", 
     "Юрий Пеньков", "Илья Сухачев", "Иван Маркитан", "Ринат Бибиков", 
     "Вадим Ерошевичев", "Тимур Сейсембаев", "Максим Батырев", "Никита Шумский", 
     "Алексей Степанов", "Денис Коротков", "Антон Глушков", 
     "Сергей Индюков", "Максим Воронцов", "Евгений Грязнов", 
     "Константин Виролайнен", "Сергей Сердюк", "Павел Дерендяев"],
    ["Евгений Шмаргунов", "Олег Булыгин", "Александр Бардин", 
     "Александр Иванов", "Кирилл Табельский", "Александр Ульянцев", 
     "Роман Гордиенко", "Адилет Асканжоев", "Александр Шлейко", 
     "Алена Батицкая", "Денис Ежков", "Владимир Чебукин", 
     "Эдгар Нуруллин", "Евгений Шек", "Максим Филипенко", 
     "Елена Никитина"],
    ["Владимир Чебукин", "Эдгар Нуруллин", "Евгений Шек", 
     "Валерий Хаслер", "Татьяна Тен", "Александр Фитискин", 
     "Александр Шлейко", "Алена Батицкая", 
     "Александр Беспоясов", "Денис Ежков", 
     "Николай Лопин", "Михаил Ларченко"]
]

@pytest.mark.parametrize("expected_output", [
    ["Азамат", "Анна", "Антон", "Александр", 
     "Денис", "Дмитрий", 
     "Евгений", "Елена", 
     "Иван", "Илья", 
     "Кирилл", "Константин",
     "Максим", "Николай",
     "Олег", "Роман",
     "Сергей", "Татьяна",
     "Юрий", 
     "Эдгар"]
])
def test_get_unique_mentors_names(expected_output):
    result = get_unique_mentors_names(courses, mentors)
    assert sorted(result) == sorted(expected_output)
